{
    "unitId": 27,
    "name": "Sushang",
    "slug": "sushang",
    "smallImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#080808",
                    "images": {
                        "fallback": {
                            "src": "/static/fb77ae92a3803222046cc60021e7c62d/e9a79/27_sm.png",
                            "srcSet": "/static/fb77ae92a3803222046cc60021e7c62d/f31ef/27_sm.png 40w,\n/static/fb77ae92a3803222046cc60021e7c62d/1f8a1/27_sm.png 80w,\n/static/fb77ae92a3803222046cc60021e7c62d/e9a79/27_sm.png 160w",
                            "sizes": "(min-width: 160px) 160px, 100vw"
                        },
                        "sources": [
                            {
                                "srcSet": "/static/fb77ae92a3803222046cc60021e7c62d/e73fe/27_sm.webp 40w,\n/static/fb77ae92a3803222046cc60021e7c62d/61ca6/27_sm.webp 80w,\n/static/fb77ae92a3803222046cc60021e7c62d/60b4d/27_sm.webp 160w",
                                "type": "image/webp",
                                "sizes": "(min-width: 160px) 160px, 100vw"
                            }
                        ]
                    },
                    "width": 160,
                    "height": 160
                }
            }
        }
    },
    "cardImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#080808",
                    "images": {
                        "fallback": {
                            "src": "/static/feedcd896cee4288044dbf9c315ca2f9/c9885/1206.png",
                            "srcSet": "/static/feedcd896cee4288044dbf9c315ca2f9/2aab7/1206.png 94w,\n/static/feedcd896cee4288044dbf9c315ca2f9/0a986/1206.png 187w,\n/static/feedcd896cee4288044dbf9c315ca2f9/c9885/1206.png 374w",
                            "sizes": "(min-width: 374px) 374px, 100vw"
                        },
                        "sources": [
                            {
                                "srcSet": "/static/feedcd896cee4288044dbf9c315ca2f9/84550/1206.webp 94w,\n/static/feedcd896cee4288044dbf9c315ca2f9/34f80/1206.webp 187w,\n/static/feedcd896cee4288044dbf9c315ca2f9/b26e2/1206.webp 374w",
                                "type": "image/webp",
                                "sizes": "(min-width: 374px) 374px, 100vw"
                            }
                        ]
                    },
                    "width": 374,
                    "height": 512
                }
            }
        }
    },
    "fullImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#080808",
                    "images": {
                        "fallback": {
                            "src": "/static/b6f5ff92c1a26b3502d65edf9a037869/3c5dc/27_full.png",
                            "srcSet": "/static/b6f5ff92c1a26b3502d65edf9a037869/ca8fd/27_full.png 200w,\n/static/b6f5ff92c1a26b3502d65edf9a037869/de50c/27_full.png 400w,\n/static/b6f5ff92c1a26b3502d65edf9a037869/3c5dc/27_full.png 800w",
                            "sizes": "(min-width: 800px) 800px, 100vw"
                        },
                        "sources": [
                            {
                                "srcSet": "/static/b6f5ff92c1a26b3502d65edf9a037869/213b2/27_full.webp 200w,\n/static/b6f5ff92c1a26b3502d65edf9a037869/413c5/27_full.webp 400w,\n/static/b6f5ff92c1a26b3502d65edf9a037869/cf6d0/27_full.webp 800w",
                                "type": "image/webp",
                                "sizes": "(min-width: 800px) 800px, 100vw"
                            }
                        ]
                    },
                    "width": 800,
                    "height": 793
                }
            }
        }
    },
    "description": {
        "formatted": "A naive and enthusiastic newcomer to the Cloud Knights who wields a greatsword. She yearns for the historic legends of the Cloud Knights, and is eager to become such a legendary figure herself. As such, Sushang firmly believes in the philosophies \"be eager to help those in need,\" \"do one good deed a day and reflect on oneself three times a day,\" leading her to busy days full of helping others."
    },
    "statsComments": null,
    "relicsComments": null,
    "skillsNew": {
        "basic": {
            "id": "120601",
            "energy_gen": "20",
            "break_primary": "30",
            "break_secondary": ""
        },
        "basic_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "basic_enh2": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "basic_enh3": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "skill": {
            "id": "120602",
            "energy_gen": "30",
            "break_primary": "60",
            "break_secondary": ""
        },
        "skill_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "ult": {
            "id": "120603",
            "energy_gen": "5",
            "break_primary": "90",
            "break_secondary": ""
        },
        "ult_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "ult_enh2": null,
        "talent": {
            "id": "120604",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "technique": {
            "id": "120607",
            "energy_gen": "",
            "break_primary": "60",
            "break_secondary": ""
        }
    },
    "defaultRole": "Main DPS",
    "affiliation": "Xianzhou Luofu",
    "rarity": "4",
    "element": "Physical",
    "path": "Hunt",
    "stats": {
        "hp_base": 124.8,
        "def_base": 57,
        "atk_base": 76.8,
        "speed_base": 107
    },
    "ascensionMaterials": {
        "mats_1": "artifex-module",
        "mats_2": "artifex-cogwheel",
        "mats_3": "broken-teeth-of-iron-wolf",
        "mats_4": "artifex-gyreheart"
    },
    "eidolon": [
        {
            "eidolonId": "27",
            "name": "Sushang",
            "upgrade1Name": "Cut With Ease",
            "upgrade1Desc": {
                "formatted": "After using Skill against a Weakness Broken enemy, regenerates 1 Skill Point."
            },
            "upgrade2Name": "Refine in Toil",
            "upgrade2Desc": {
                "formatted": "After triggering Sword Stance, the DMG taken by Sushang is reduced by 20% for 1 turn."
            },
            "upgrade3Name": "Rise From Fame",
            "upgrade3Desc": {
                "formatted": "Ultimate Lv. +2, up to a maximum of Lv. 15. Talent Lv. +2, up to a maximum of Lv. 15."
            },
            "upgrade4Name": "Cleave With Heart",
            "upgrade4Desc": {
                "formatted": "Sushang's Break Effect increases by 40%."
            },
            "upgrade5Name": "Prevail via Taixu",
            "upgrade5Desc": {
                "formatted": "Skill Lv. +2, up to a maximum of Lv. 15. Basic ATK Lv. +1, up to a maximum of Lv. 10."
            },
            "upgrade6Name": "Dwell Like Water",
            "upgrade6Desc": {
                "formatted": "Talent's SPD Boost is stackable and can stack up to 2 times. Additionally, after entering battle, Sushang immediately gains 1 stack of her Talent's SPD Boost.\n\n"
            }
        }
    ],
    "synergy": null,
    "traces": [
        {
            "req": "A2",
            "desc": "When current HP percentage is 50% or lower, reduces the chance of being attacked by enemies.",
            "name": "Guileless"
        },
        {
            "req": "A4",
            "desc": "For every Sword Stance triggered, the DMG dealt by Sword Stance increases by <b>2.5%</b>. Stacks up to 10 time(s).",
            "name": "Riposte"
        },
        {
            "req": "A6",
            "desc": "After using Basic ATK or Skill, if there are enemies on the field with Weakness Break, Sushang's action is Advanced Forward by <b>15%</b>.",
            "name": "Vanquisher"
        }
    ],
    "review": {
        "formatted": "Sushang is a competent single-target damage dealer with a focus on attacking Broken enemies and having Weakness Broken enemies on the field. She is able to fully Action Advance herself with her Ultimate and excels at putting on the pressure against Broken enemies. Both her damage potential and speed rely on having enemies in this state, so it is important to facilitate this with her teammates.Sushang feels like she’s on the cusp of greatness, now more than ever with Ruan Mei’s existence in the game. Being so focused around Breaking and abusing Weakness Broken foes, she only really needs a little bit more to come her way for her to become a highly dangerous boss killing machine.Sushang’s Skill deals up to 210% ATK to a single enemy and has a 33% fixed chance to trigger Sword Stance on the final hit, dealing an additional 100% ATK. This bonus damage is guaranteed on Broken enemies. This is already a strong start with her Skill dealing potentially 310% ATK with nothing else. Sushang’s Ultimate deals 320% ATK to a single enemy and immediately Advances her forward by 100%, meaning it is her turn now. She also gets a 30% ATK increase for 2 turns, and her Skill has 2 extra chances at triggering Sword Stance, with the extra procs being at 50% of the original damage.This means that Sushang’s Ultimate boosts her Skill significantly. The extra ATK aside, having 2 extra procs of Sword Stance at 50% means she’s essentially getting a full power bonus hit, meaning that if all 3 Sword Stances activate, Sushang’s Skill is doing 410% ATK to a single enemy. Once again, keep in mind that against a Broken enemy Sword Stance is guaranteed to proc, including the bonus ones from her Ultimate. With the Ultimate having an average Energy cost of 120, this will be up fairly often. The addition of having a 100% Action Advance inherent to the Ultimate is also very powerful as you can make Sushang take back-to-back turns, maximising the damage you can deal against Broken foe.Sushang’s Talent gives her a 20% SPD boost for 2 turns when an enemy on the field has their Weakness Broken. Sushang’s base SPD is above average but a little on the lower end for Hunt units at 107, meaning her Talent will be granting her just about 21 SPD. This is still a pretty substantial increase to SPD and can possibly allow for her to run ATK Boots without worrying about SPD too much.Now, let’s talk about the obvious issue with this kit; it has far too much reliance on having enemies be Broken. Pretty much all of what Sushang has to offer is contingent on that one big asterisk. Depending on what you’re against, this may not be too much of a challenge, but even against simple Elites, the frequency at which you will be Breaking enemies will drop dramatically, especially if the Elite is not a summoner type. Boss enemies have even greater Toughness bars meaning it can take even longer to Break them.This may naturally incentivize the player to build for more Break Effect on Sushang, and the issue with that is that you kinda… can’t, really. Let me elaborate by way of a comparison; Xueyi is a Break unit that directly benefits from building Break Effect thanks to a passive that grants an equivalent amount of DMG%, and even she can’t afford to go all out on Break Effect because of diminishing returns and the desire for CRIT stats. Now imagine that but without the DMG conversion passive and exclusively single-target, and you’ve got Sushang. Yeah… it’s not ideal, especially since Xueyi also benefits from merely dealing Toughness Damage, while Sushang only gets her benefits upon an enemy getting fully Broken.Sushang is a very momentum-driven character; she thrives when enemies are Broken, and the goal is to make the most out of those situations before they recover. This is especially amplified by Sushang’s A6 Bonus Ability Trace, which Action Advances her forward by 15% after using a Basic ATK or Skill if there’s even a single Broken enemy on the field. This makes Sushang a deceptively speedy character, and both accentuates and exacerbates all of the aforementioned things in her kit. A2 also gives some nice DMG to Sword Stance every time it’s triggered, and A4 exists.With Eidolons, Sushang becomes noticeably stronger. E1 will refund a Skill Point when using Skill against a Broken enemy, leading to never needing to worry about SP when attacking them. E2 will reduce Sushang’s DMG taken by 20% after a Sword Stance is triggered for 1 turn, offering a nice and fairly significant reduction in damage taken. E4 grants Sushang a permanent plus 40% Break Effect which helps in dealing more damage when she is the one Breaking, and finally E6 allows the Talent’s SPD boost to stack up to 2 times, also granting her one stack immediately upon entering combat. This means Sushang can gain almost 43 SPD from just her Talent alone, meaning she almost becomes a mini Seele in terms of raw Actions taken.Ah, but what’s this? A comparison to Seele? Yeah don’t get excited, when I say it’s only in terms of raw Actions taken, I mean it explicitly. What Seele is is an anomaly when it comes to Hunt units because she actually gets better with more enemies around. Sushang, unfortunately, falls into the same category as ‘every other Hunt unit besides Seele and maybe Ratio’. Without sufficient help from supports or potentially even a second damage dealer, Sushang will absolutely hate going against multiple opponents. Add in the need for enemies to Broken and you now have a unit virtually glued at the hip to Ruan Mei, and even then it may still not be enough on its own if the enemy isn’t also weak to Ice.The ramp-up to dealing damage can be excruciatingly long, and with how fast enemies become in the endgame, the window of opportunity to actually deal said damage is exceptionally short, so it’s no surprise that units that simply don’t have that limitation are typically far stronger than Sushang at much less effort — after all, who cares if the enemy is Broken if they’re already dead? (This post made by Seele/Jingliu/JingYuan/Qingque/DHIL/Blade/Kafka… You get the idea.)Seriously, it gets almost annoying to have everything lined up perfectly with supports only to go in and hit numbers that make you rethink your life choices. On my way to call the police and report a goddamned robbery. Sushang may be fast but she doesn’t have anything else in her kit to boost her damage like the ridiculous 80% DMG and 20% QUA RES PEN that Seele gets. The need for CRIT stats and ATK while also baiting people into building Break Effect can make for some of the most botched builds in the game; some of the worst builds I’ve ever seen have all been on Sushang.Having said that, I return to what I said at the very beginning. With Ruan Mei existing now, break-focused builds and units have new life breathed into them. Now that we’re at this juncture, my prediction is that we only need one more unit that can facilitate the Break playstyle for someone like Sushang to absolutely pop off. Mark my words, it’ll happen.In any case, Sushang is still a competent character in her own right, and someone players are likely to have access to. Especially if you are lacking coverage for Physical enemies and don’t have the likes of Argenti, Clara, or even Luka, then Sushang should be someone you consider building."
    },
    "pros": {
        "formatted": "Oppressive rush-down when facing Broken enemies, Deceptively speedy character, High base Ability multipliers, Scales well with Eidolons."
    },
    "cons": {
        "formatted": "Damage and speed falter if enemies are not being Broken frequently, Purely single-target, Subject to RNG if enemies are not Broken, Potentially SP hungry without Eidolons, Doesn’t yet have the optimal teammates for her playstyle.\n"
    },
    "endgameStats": {
        "formatted": "HP: 3000+ DEF: 800 - 1000+ATK: 1900 - 2700+CRIT RATE: 60% - 70%+CRIT DMG: 120% - 140%+SPD: Base Speed (Hyperspeed Sparkle/Bronya) / 134 (Recommended) / 143 / 160BREAK EFFECT: 0% - 120%+ "
    },
    "voiceActors": {
        "en": "Anjali Kunapanen",
        "kr": "Park Si-yoon (박시윤)",
        "jpn": "Fukuen Misato (福圓美里)",
        "cn": "Chen Tingting (陈婷婷)"
    },
    "ratings": {
        "moc": "5",
        "moc_special": "5",
        "pure": "4",
        "pure_special": "4",
        "apo": "8",
        "apo_special": "7"
    },
    "energyUltimate": "120",
    "conesNew": [
        {
            "cone": "swordplay",
            "super": "5",
            "percent": "114.51%",
            "notes": "Assumes full access to all 5 stacks throughout the entire duration of the fight. In fights where target swapping is required this Cone performance can be reduced substantially."
        },
        {
            "cone": "in-the-night",
            "super": "1",
            "percent": "112.77%",
            "notes": "Calcs contain some reallocation of ATK%, CRIT RATE and CRIT DMG% to SPD in order to achieve 4-6 stacks of the bonus. Each character is configured to reach the Speed breakpoint that grants them the most damage with this Cone. under the simulation conditions. With better relics and teams that grant more Speed this lightcones performance will improve comparatively."
        },
        {
            "cone": "only-silence-remains",
            "super": "5",
            "percent": "103.55%",
            "notes": "Assumes the fight is limited to 2 or fewer enemies at all times. In fights where more than two enemies are present for any portion of it, this Cone performance will drop."
        },
        {
            "cone": "cruising-in-the-stellar-sea",
            "super": "5",
            "percent": "100%",
            "notes": "Assumes the on-kill ATK% boost can be maintained 66% of the time in the fight and that enemies are at 50% of their life for half the fight. In fights where the ATK% buff cannot be maintained the performance of this Cone will reduce."
        },
        {
            "cone": "sleep-like-the-dead",
            "super": "5",
            "percent": "99.06%",
            "notes": "-"
        },
        {
            "cone": "return-to-darkness",
            "super": "5",
            "percent": "96.11%",
            "notes": "-"
        }
    ],
    "buildData": [
        {
            "relics": [
                {
                    "relic": "Champion of Streetwise Boxing",
                    "relic_2": "",
                    "value": "100%",
                    "comment": "",
                    "notes": null
                },
                {
                    "relic": "Pioneer Diver of Dead Waters",
                    "relic_2": "Champion of Streetwise Boxing",
                    "value": "97.55%",
                    "comment": "",
                    "notes": null
                },
                {
                    "relic": "Champion of Streetwise Boxing",
                    "relic_2": "Musketeer of Wild Wheat",
                    "value": "95.36%",
                    "comment": "",
                    "notes": null
                }
            ],
            "planars": [
                {
                    "planar": "Rutilant Arena",
                    "value": "100%",
                    "comment": "",
                    "notes": null
                },
                {
                    "planar": "Firmament Frontline: Glamoth",
                    "value": "99.43%",
                    "comment": "160 Speed",
                    "notes": null
                },
                {
                    "planar": "Firmament Frontline: Glamoth",
                    "value": "95.95%",
                    "comment": "135 Speed",
                    "notes": null
                },
                {
                    "planar": "Inert Salsotto",
                    "value": "92.64%",
                    "comment": "",
                    "notes": null
                },
                {
                    "planar": "Space Sealing Station",
                    "value": "92.63%",
                    "comment": "",
                    "notes": null
                }
            ],
            "cones": [
                {
                    "cone": "in-the-night",
                    "super": "1"
                },
                {
                    "cone": "swordplay",
                    "super": "5"
                },
                {
                    "cone": "sleep-like-the-dead",
                    "super": "1"
                },
                {
                    "cone": "swordplay",
                    "super": "1"
                },
                {
                    "cone": "cruising-in-the-stellar-sea",
                    "super": "5"
                },
                {
                    "cone": "only-silence-remains",
                    "super": "1"
                }
            ],
            "body": [
                {
                    "stat": "CRIT Rate"
                },
                {
                    "stat": "CRIT DMG"
                }
            ],
            "feet": [
                {
                    "stat": "Speed"
                },
                {
                    "stat": "ATK%"
                }
            ],
            "rope": [
                {
                    "stat": "ATK%"
                },
                {
                    "stat": "Break Effect"
                }
            ],
            "sphere": [
                {
                    "stat": "Physical DMG"
                },
                {
                    "stat": "ATK%"
                }
            ],
            "comments": "This is your typical DPS build that focuses on the holy trifecta - ATK, Crit Rate, and Crit DMG. For every 1% of Crit try to have 2% of Crit DMG.",
            "substats": "SPD (breakpoint) > BREAK EFFECT% (If Break Build) >= CRIT RATE = CRIT DMG > ATK%",
            "skill_priority": "Skill > Ultimate > Talent > Basic",
            "traces_priority": "Riposte > Vanquisher > Guileless",
            "name": "General DPS"
        }
    ],
    "videos": null,
    "teams": [
        {
            "name": "F2P Team",
            "member_1": "sushang",
            "member_2": "natasha",
            "member_3": "trailblazer-fire",
            "member_4": "serval"
        }
    ],
    "characterBuilderInfo": {
        "traceStat1": {
            "stat": "atk",
            "value": 28
        },
        "traceStat2": {
            "stat": "hp",
            "value": 18
        },
        "traceStat3": {
            "stat": "def",
            "value": 12.5
        },
        "traceStatMajor1": {
            "stat": "",
            "value": 0
        },
        "traceStatMajor2": {
            "stat": "",
            "value": 0
        },
        "traceStatMajor3": {
            "stat": "",
            "value": 0
        }
    },
    "tierCategory": "Specialist",
    "releaseDate": "April 26th, 2023",
    "isReleased": true,
    "isNew": null,
    "hideSkills": false,
    "isReviewPending": false,
    "availableInCbt3": null,
    "showBuild": true,
    "tierListNew": null,
    "tierListTags": [
        "Break",
        "ADV"
    ]
}