{
    "unitId": 1,
    "name": "Trailblazer (Physical)",
    "slug": "trailblazer-physical",
    "smallImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#f8e8e8",
                    "images": {
                        "fallback": {
                            "src": "/static/0fe244adf41a88f67ba67ef2058d7ee1/60b4d/phys_mc_icon.webp",
                            "srcSet": "/static/0fe244adf41a88f67ba67ef2058d7ee1/e73fe/phys_mc_icon.webp 40w,\n/static/0fe244adf41a88f67ba67ef2058d7ee1/61ca6/phys_mc_icon.webp 80w,\n/static/0fe244adf41a88f67ba67ef2058d7ee1/60b4d/phys_mc_icon.webp 160w",
                            "sizes": "(min-width: 160px) 160px, 100vw"
                        },
                        "sources": []
                    },
                    "width": 160,
                    "height": 160
                }
            }
        }
    },
    "cardImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#f8f8f8",
                    "images": {
                        "fallback": {
                            "src": "/static/42abbd988658e83e6cac80211e4920b6/b26e2/phys_mc_card.webp",
                            "srcSet": "/static/42abbd988658e83e6cac80211e4920b6/84550/phys_mc_card.webp 94w,\n/static/42abbd988658e83e6cac80211e4920b6/34f80/phys_mc_card.webp 187w,\n/static/42abbd988658e83e6cac80211e4920b6/b26e2/phys_mc_card.webp 374w",
                            "sizes": "(min-width: 374px) 374px, 100vw"
                        },
                        "sources": []
                    },
                    "width": 374,
                    "height": 512
                }
            }
        }
    },
    "fullImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#080808",
                    "images": {
                        "fallback": {
                            "src": "/static/5b7844f4a03c895f036e6acf5db2b492/3c5dc/2_full.png",
                            "srcSet": "/static/5b7844f4a03c895f036e6acf5db2b492/ca8fd/2_full.png 200w,\n/static/5b7844f4a03c895f036e6acf5db2b492/de50c/2_full.png 400w,\n/static/5b7844f4a03c895f036e6acf5db2b492/3c5dc/2_full.png 800w",
                            "sizes": "(min-width: 800px) 800px, 100vw"
                        },
                        "sources": [
                            {
                                "srcSet": "/static/5b7844f4a03c895f036e6acf5db2b492/213b2/2_full.webp 200w,\n/static/5b7844f4a03c895f036e6acf5db2b492/413c5/2_full.webp 400w,\n/static/5b7844f4a03c895f036e6acf5db2b492/cf6d0/2_full.webp 800w",
                                "type": "image/webp",
                                "sizes": "(min-width: 800px) 800px, 100vw"
                            }
                        ]
                    },
                    "width": 800,
                    "height": 793
                }
            }
        }
    },
    "description": {
        "formatted": "A girl/boy who boarded the Astral Express. They chose to travel with the Astral Express to eliminate the dangers posed by the Stellaron. "
    },
    "statsComments": null,
    "relicsComments": null,
    "skillsNew": {
        "basic": {
            "id": "800101",
            "energy_gen": "20",
            "break_primary": "30",
            "break_secondary": ""
        },
        "basic_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "basic_enh2": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "basic_enh3": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "skill": {
            "id": "800102",
            "energy_gen": "30",
            "break_primary": "60",
            "break_secondary": "30"
        },
        "skill_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "ult": {
            "id": "800103",
            "energy_gen": "5",
            "break_primary": "",
            "break_secondary": ""
        },
        "ult_enh": {
            "id": "800108",
            "energy_gen": "5",
            "break_primary": "60",
            "break_secondary": ""
        },
        "ult_enh2": {
            "id": "800109",
            "energy_gen": "5",
            "break_primary": "60",
            "break_secondary": "60"
        },
        "talent": {
            "id": "800104",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "technique": {
            "id": "800107",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        }
    },
    "defaultRole": "Main DPS",
    "affiliation": "Astral Express",
    "rarity": "5",
    "element": "Physical",
    "path": "Destruction",
    "stats": {
        "hp_base": 163.68,
        "def_base": 62.7,
        "atk_base": 84.48,
        "speed_base": 100
    },
    "ascensionMaterials": {
        "mats_1": "thiefs-instinct",
        "mats_2": "usurpers-scheme",
        "mats_3": "enigmatic-ectostella",
        "mats_4": "conquerors-will"
    },
    "eidolon": [
        {
            "eidolonId": "1",
            "name": "Trailblazer (physical)",
            "upgrade1Name": "A Falling Star",
            "upgrade1Desc": {
                "formatted": "When enemies are defeated due to the Trailblazer's Ultimate, the Trailblazer regenerates 10 extra Energy. This effect can only be triggered once per attack."
            },
            "upgrade2Name": "An Unwilling Host",
            "upgrade2Desc": {
                "formatted": "Attacking enemies with Physical Weakness restores the Trailblazer's HP equal to 5% of the Trailblazer's ATK."
            },
            "upgrade3Name": "A Leading Whisper",
            "upgrade3Desc": {
                "formatted": "Skill Lv. +2, up to a maximum of Lv. 15. Talent Lv. +2, up to a maximum of Lv. 15."
            },
            "upgrade4Name": "A Destructing Glance",
            "upgrade4Desc": {
                "formatted": "When attacking an enemy with Weakness Break, CRIT Rate is increased by 25%."
            },
            "upgrade5Name": "A Surviving Hope",
            "upgrade5Desc": {
                "formatted": "Ultimate Lv. +2, up to a maximum of Lv. 15. Basic ATK Lv. +1, up to a maximum of Lv. 10."
            },
            "upgrade6Name": "A Trailblazing Will",
            "upgrade6Desc": {
                "formatted": "The Trailblazer's Talent is also triggered when they defeat an enemy."
            }
        }
    ],
    "synergy": null,
    "traces": [
        {
            "req": "A2",
            "desc": "At the start of the battle, immediately regenerates 15 Energy.",
            "name": "Ready for Battle"
        },
        {
            "req": "A4",
            "desc": "Each stack of Talent increases the Trailblazer's DEF by <b>10%</b>.",
            "name": "Perseverance"
        },
        {
            "req": "A6",
            "desc": "When using Skill or Ultimate Blowout: RIP Home Run, DMG dealt to the target enemy is increased by <b>25%</b>.",
            "name": "Fighting Will"
        }
    ],
    "review": {
        "formatted": "The Destruction Trailblazer is the first character players gain access to. They are a competent and versatile damage dealer in the early game that you will naturally unlock all the Eidolons for. They get a lot of free stat boosts during combat via Breaking enemies, and are able to choose from a hard-hitting single-target Ultimate and a Blast AoE Ultimate that is stronger against 3 targets.The very first version of the Trailblazer is a good damage dealer early on, especially as there are many Physical weak enemies for them to hit homeruns on. Later on in the game, this form of the Trailblazer will start to lose effectiveness as there is not much in their kit to allow them to truly excel. By no means does this make the Destruction Trailblazer unusable; if you choose to invest in them a lot they will eventually start to become very strong, but the undeniable truth is that there are far better ways to use your limited resources than focusing on a character that was designed to become obsolete.Their Skill is a Blast AoE, dealing damage to the targeted enemy and the adjacent foes. This is the only Blast AoE in the game that does not inherently deal more damage to the targeted enemy, instead dealing the same damage to all three enemies hit. This Skill will still deal increased Toughness damage to the primary foe. The multiplier on this Skill is not very impressive at all, especially as there are not many ways for the Destruction Trailblazer to boost their own damage without outside help; 125% ATK at max Trace level is quite underwhelming in single-target scenarios, but it does start to become quite powerful in multi-target situations.The Destruction Trailblazer’s Ultimate is also one of a kind, as it’s the only Ultimate in the game at present to give you a choice of attack, either a massive single-target swing, or a Blast AoE hit. Both versions are surprisingly strong in terms of their raw multipliers, with the single target swing dealing up to 450% ATK, and the Blast dealing 270% ATK to the main target and 162% to adjacent foes for a total multiplier of 594%. This is quite a hefty amount for only a 120 cost Ultimate.It is now plain to see that much of the Destruction Trailblazer’s power is focused in their Ultimate, especially in single-target encounters. It is unfortunate then that the Trailblazer has no inherent ways of gaining more Energy for themselves, and the Ultimate itself is not strong enough to offset the lackluster damage outside of it.Their Talent helps somewhat as it offers a permanent ATK boost of 20% at max Trace level, stacking twice for up to 40%. This can only be obtained via the Trailblazer directly breaking enemies, or by killing them with their E6. A permanent ATK boost is always appreciated, especially as it is approaching the value of a main stat Relic piece, but ATK is already a very saturated stat; there are many ways to get more of it, and many support characters specialise in providing more ATK for characters. As a result, this Talent ends up losing a lot of value over time, especially as the player gains access to more support options.The conditions for activating this Talent are also rather strict. It is very easy to activate in the early game where there are many weak enemies whose Toughness gauges are miniscule, enough that a single targeted Skill will break them, or they can be killed outright. As the game progresses though, there are more enemies showing up that have larger Toughness gauges and substantially larger health pools, making it increasingly more difficult to activate this Talent’s boosts. Their Major Traces provide some extra benefits but nothing too spectacular until A6. A2 gives a free 15 Energy at the start of a fight, and A4 allows the Talent to also stack 10% DEF, for a total of 20% DEF. Neither of these are particularly significant, though the extra free DEF is definitely appreciated in terms of survivability. A6 however grants a 25% damage bonus to the single-target damage portions of their AoE abilities. Definitely a big increase to the overall performance of Destruction Trailblazer, but a shame it comes so late.In terms of Eidolons, as the main character, you will earn all of their Eidolons over time. Rather unfortunately, none of them are substantial increases in performance — the unfortunate fate of a starter unit such as this. The only really intriguing one is E4, which gives a 25% increase to CRIT Rate when attacking enemies currently afflicted with Weakness Break, as not only is this a large amount of CRIT to be getting for basically free, it also doesn’t discriminate what the enemy is actually weak to, meaning any Broken enemy will provide this benefit even if they are not weak to Physical.The Destruction Trailblazer is definitely versatile in the early and even mid game sections, but suffers from trying to do too much at once. They want to have good damage in both single-target and AoE but are spread too thin and so can never excel in either; their Minor Traces are an even spread of ATK, HP, and DEF meaning they are never quite strong enough to accentuate the things they are good at; and their most pivotal upgrades in the form of A6 and E4 come too late for it to matter, since by that point most players will already have other characters they wish to level.There’s just no opportunity for the Destruction Trailblazer to thrive. When faced with the inevitable question of ‘Is Destruction Trailblazer worth my resources and materials?’. Outside of levelling them up for the alternate versions of the Trailblazer the story will eventually unlock, the equally inevitable answer is in virtually all cases ‘No’. The final nail in that coffin is that each flavour of Trailblazer are mutually exclusive with each other; if you’re using one, you’re not using the others, and as the paths also differ greatly so too do the relics and Light Cones, and Trace upgrade progress is not shared either, so unless you’re absolutely dead set on using the Destruction Trailblazer, they are an investment black hole.All the other Physical characters are substantially more powerful and at least have niches in which they are able to truly excel. Sushang and Luka dominate the single-target spaces and are fairly accessible as 4-stars. Meanwhile, Clara and Argenti are absolute behemoths, with the former being quite accessible as a standard 5-star, potentially even being players first 5-star ever, basically solidifying that the Destruction form of the Trailblazer is promptly shelved. Argenti is a limited 5-star, but he’s almost a perfect refinement of the Trailblazer’s kit, having enough power to comfortably place him among the top damage dealers in the game.Of course, if you just like using the Destruction Trailblazer then you are more than welcome to. It is just a game after all, and the primary and arguably only intent is to have fun. There are already videos of people using this version of the Trailblazer to massacre the final stages of Memory of Chaos, and there’s probably only going to be more over time, so you can rest assured that if you do choose to go down this path, you will be rewarded.Just remember dear reader: there is no circumventing the cost, and regret has a way of sticking around. Believe me, I would know… But it is ultimately your choice. ‘Rules are meant to be broken’ after all."
    },
    "pros": {
        "formatted": "Versatile damage dealer in the early game, You’ll get all their Eidolons over time, Out of combat healing, Decent in AoE even later on.\n\n"
    },
    "cons": {
        "formatted": "Damage lags behind significantly beyond the early game, Talent has a ramp-up time, Very few meaningful buffs in their kit, Spreads themselves too thin becoming mediocre in everything, The other versions of Trailblazer will have a lot more value and staying power."
    },
    "endgameStats": {
        "formatted": "HP: 3400+ DEF: 800 - 1000+ATK: 2000 - 2800+ CRIT RATE: 65% - 70%+CRIT DMG: 120% - 130%+SPD: Base Speed (Hyperspeed Sparkle/Bronya) / 134 (Recommended) / 143BREAK EFFECT: 0% - 120%+ "
    },
    "voiceActors": {
        "en": "Rachael Chau | Caleb Yen",
        "kr": "Kim Ha-ru (김하루) | Kim Myung-jun (김명준)",
        "jpn": "Ishikawa Yui (石川 由依) | Enoki Junya (榎木 淳弥)",
        "cn": "Chen Tingting (陈婷婷) | Qin Juge (秦且歌)"
    },
    "ratings": {
        "moc": "4",
        "moc_special": "4",
        "pure": "4",
        "pure_special": "4",
        "apo": "4",
        "apo_special": "4"
    },
    "energyUltimate": "120",
    "conesNew": [
        {
            "cone": "on-the-fall-of-an-aeon",
            "super": "5",
            "percent": "100%",
            "notes": "Assumes you maintain the full 4 attack stacks (64% ATK) at all times and maintain the weakness break bonus 50% of the time. In fights where this is not the case for the majority of the duration its damage will be lower."
        },
        {
            "cone": "under-the-blue-sky",
            "super": "5",
            "percent": "95.40%",
            "notes": "Assumes to have 100% uptime of its on-kill buff at all times. In fights where this is not the case for the majority of the duration, its damage will be lower."
        },
        {
            "cone": "on-the-fall-of-an-aeon",
            "super": "5",
            "percent": "93.16%",
            "notes": "On the Fall of An Aeon with 0% uptime is calculated assuming you maintain the full 4 attack stacks (64% ATK) at all times and the weakness break bonus is never active - which is the case in most fights the enemy is not vulnerable to the wearer of the Cone."
        },
        {
            "cone": "the-moles-welcome-you",
            "super": "5",
            "percent": "91.48%",
            "notes": "Assumes to have 100% uptime of all 3 components of its buff requiring a Basic ATK, Skill and Ultimate. In fights where this is not the case for the majority of the duration, its damage will be lower"
        },
        {
            "cone": "a-secret-vow",
            "super": "5",
            "percent": "89.13%",
            "notes": "Assumes to only have its base 40% damage increase active as enemies almost always have higher lower HP than your units. In fights where this is not the case and your units end up at lower HP than the enemy its performance will increase."
        },
        {
            "cone": "the-moles-welcome-you",
            "super": "5",
            "percent": "84.85%",
            "notes": "Assumes to have 100% uptime of 2 components of its buff requiring two of Basic ATK, Skill and Ultimate. In fights where this is not the case for the majority of the duration, its damage will be lower"
        },
        {
            "cone": "under-the-blue-sky",
            "super": "5",
            "percent": "80.43%",
            "notes": "Assumes to have 0% uptime of its on-kill buff."
        }
    ],
    "buildData": [
        {
            "relics": [
                {
                    "relic": "Champion of Streetwise Boxing",
                    "relic_2": "",
                    "value": "105.27%",
                    "comment": "",
                    "notes": null
                },
                {
                    "relic": "Champion of Streetwise Boxing",
                    "relic_2": "Musketeer of Wild Wheat",
                    "value": "101.18%",
                    "comment": "",
                    "notes": null
                },
                {
                    "relic": "Musketeer of Wild Wheat",
                    "relic_2": "",
                    "value": "100.00%",
                    "comment": "",
                    "notes": null
                }
            ],
            "planars": [
                {
                    "planar": "Rutilant Arena",
                    "value": "100%",
                    "comment": "",
                    "notes": null
                },
                {
                    "planar": "Firmament Frontline: Glamoth",
                    "value": "98.77%",
                    "comment": "135 Speed",
                    "notes": null
                },
                {
                    "planar": "Inert Salsotto",
                    "value": "97.67%",
                    "comment": "",
                    "notes": null
                },
                {
                    "planar": "Space Sealing Station",
                    "value": "95.36%",
                    "comment": "",
                    "notes": null
                }
            ],
            "cones": [
                {
                    "cone": "on-the-fall-of-an-aeon",
                    "super": "5"
                }
            ],
            "body": [
                {
                    "stat": "CRIT Rate"
                },
                {
                    "stat": "CRIT DMG"
                }
            ],
            "feet": [
                {
                    "stat": "Speed"
                },
                {
                    "stat": "ATK%"
                }
            ],
            "rope": [
                {
                    "stat": "ATK%"
                },
                {
                    "stat": "Break Effect"
                }
            ],
            "sphere": [
                {
                    "stat": "Physical DMG"
                },
                {
                    "stat": "ATK%"
                }
            ],
            "comments": "This is your typical DPS build that focuses on the holy trifecta - ATK, Crit Rate, and Crit DMG. For every 1% of Crit try to have 2% of Crit DMG. But you can also play Physical MC as Breaker and in that case, you will want to focus on BREAK EFFECT too.",
            "substats": "SPD (breakpoint) > BREAK EFFECT% (If Break Build) >= CRIT RATE = CRIT DMG > ATK%",
            "skill_priority": "Skill > Ultimate > Talent > Basic",
            "traces_priority": "Fighting Will > Ready for Battle > Perseverance",
            "name": "General DPS"
        }
    ],
    "videos": null,
    "teams": [
        {
            "name": "F2P Team",
            "member_1": "trailblazer-physical",
            "member_2": "natasha",
            "member_3": "march-7th",
            "member_4": "dan-heng"
        }
    ],
    "characterBuilderInfo": {
        "traceStat1": {
            "stat": "def",
            "value": 12.5
        },
        "traceStat2": {
            "stat": "atk",
            "value": 28
        },
        "traceStat3": {
            "stat": "hp",
            "value": 18
        },
        "traceStatMajor1": {
            "stat": "",
            "value": 0
        },
        "traceStatMajor2": {
            "stat": "",
            "value": 0
        },
        "traceStatMajor3": {
            "stat": "",
            "value": 0
        }
    },
    "tierCategory": "DPS",
    "releaseDate": "April 26th, 2023",
    "isReleased": true,
    "isNew": false,
    "hideSkills": false,
    "isReviewPending": false,
    "availableInCbt3": null,
    "showBuild": true,
    "tierListNew": null,
    "tierListTags": null
}