{
    "unitId": 32,
    "name": "Yukong",
    "slug": "yukong",
    "smallImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#383838",
                    "images": {
                        "fallback": {
                            "src": "/static/f64318898539865f4a119bb65074bf3d/e9a79/32_sm.png",
                            "srcSet": "/static/f64318898539865f4a119bb65074bf3d/f31ef/32_sm.png 40w,\n/static/f64318898539865f4a119bb65074bf3d/1f8a1/32_sm.png 80w,\n/static/f64318898539865f4a119bb65074bf3d/e9a79/32_sm.png 160w",
                            "sizes": "(min-width: 160px) 160px, 100vw"
                        },
                        "sources": [
                            {
                                "srcSet": "/static/f64318898539865f4a119bb65074bf3d/e73fe/32_sm.webp 40w,\n/static/f64318898539865f4a119bb65074bf3d/61ca6/32_sm.webp 80w,\n/static/f64318898539865f4a119bb65074bf3d/60b4d/32_sm.webp 160w",
                                "type": "image/webp",
                                "sizes": "(min-width: 160px) 160px, 100vw"
                            }
                        ]
                    },
                    "width": 160,
                    "height": 160
                }
            }
        }
    },
    "cardImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#080808",
                    "images": {
                        "fallback": {
                            "src": "/static/8e868d9dd5fabb2e8f693f909200d7e6/c9885/1207.png",
                            "srcSet": "/static/8e868d9dd5fabb2e8f693f909200d7e6/2aab7/1207.png 94w,\n/static/8e868d9dd5fabb2e8f693f909200d7e6/0a986/1207.png 187w,\n/static/8e868d9dd5fabb2e8f693f909200d7e6/c9885/1207.png 374w",
                            "sizes": "(min-width: 374px) 374px, 100vw"
                        },
                        "sources": [
                            {
                                "srcSet": "/static/8e868d9dd5fabb2e8f693f909200d7e6/84550/1207.webp 94w,\n/static/8e868d9dd5fabb2e8f693f909200d7e6/34f80/1207.webp 187w,\n/static/8e868d9dd5fabb2e8f693f909200d7e6/b26e2/1207.webp 374w",
                                "type": "image/webp",
                                "sizes": "(min-width: 374px) 374px, 100vw"
                            }
                        ]
                    },
                    "width": 374,
                    "height": 512
                }
            }
        }
    },
    "fullImage": {
        "localFile": {
            "childImageSharp": {
                "gatsbyImageData": {
                    "layout": "constrained",
                    "backgroundColor": "#080808",
                    "images": {
                        "fallback": {
                            "src": "/static/2e12841a3cf37202ac046bcf6951b60d/3c5dc/32_full.png",
                            "srcSet": "/static/2e12841a3cf37202ac046bcf6951b60d/ca8fd/32_full.png 200w,\n/static/2e12841a3cf37202ac046bcf6951b60d/de50c/32_full.png 400w,\n/static/2e12841a3cf37202ac046bcf6951b60d/3c5dc/32_full.png 800w",
                            "sizes": "(min-width: 800px) 800px, 100vw"
                        },
                        "sources": [
                            {
                                "srcSet": "/static/2e12841a3cf37202ac046bcf6951b60d/213b2/32_full.webp 200w,\n/static/2e12841a3cf37202ac046bcf6951b60d/413c5/32_full.webp 400w,\n/static/2e12841a3cf37202ac046bcf6951b60d/cf6d0/32_full.webp 800w",
                                "type": "image/webp",
                                "sizes": "(min-width: 800px) 800px, 100vw"
                            }
                        ]
                    },
                    "width": 800,
                    "height": 793
                }
            }
        }
    },
    "description": {
        "formatted": "Head of the Sky-Faring Commission on the Xianzhou Luofu. Yukong was a seasoned pilot and a deadshot. Since heading up the commission, she's been buried under mountains of paperwork."
    },
    "statsComments": null,
    "relicsComments": null,
    "skillsNew": {
        "basic": {
            "id": "120701",
            "energy_gen": "20",
            "break_primary": "30",
            "break_secondary": ""
        },
        "basic_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "basic_enh2": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "basic_enh3": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "skill": {
            "id": "120702",
            "energy_gen": "30",
            "break_primary": "",
            "break_secondary": ""
        },
        "skill_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "ult": {
            "id": "120703",
            "energy_gen": "5",
            "break_primary": "90",
            "break_secondary": ""
        },
        "ult_enh": {
            "id": "",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "ult_enh2": null,
        "talent": {
            "id": "120704",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        },
        "technique": {
            "id": "120707",
            "energy_gen": "",
            "break_primary": "",
            "break_secondary": ""
        }
    },
    "defaultRole": "Support",
    "affiliation": "Xianzhou Luofu",
    "rarity": "4",
    "element": "Imaginary",
    "path": "Harmony",
    "stats": {
        "hp_base": 124.8,
        "def_base": 51,
        "atk_base": 81.6,
        "speed_base": 107
    },
    "ascensionMaterials": {
        "mats_1": "artifex-module",
        "mats_2": "artifex-cogwheel",
        "mats_3": "golden-crown-of-the-past-shadow",
        "mats_4": "artifex-gyreheart"
    },
    "eidolon": [
        {
            "eidolonId": "32",
            "name": "Yukong",
            "upgrade1Name": "Aerial Marshal",
            "upgrade1Desc": {
                "formatted": "At the start of battle, increases the SPD of all allies by 10% for 2 turn(s)."
            },
            "upgrade2Name": "Skyward Command",
            "upgrade2Desc": {
                "formatted": "When any ally's current energy is equal to its energy limit, Yukong regenerates an additional 5 energy. This effect can only be triggered once for each ally. The trigger count is reset after Yukong casts her Ultimate."
            },
            "upgrade3Name": "Torrential Fusillade",
            "upgrade3Desc": {
                "formatted": "Skill Lv. +2, up to a maximum of Lv. 15. Basic ATK Lv. +1, up to a maximum of Lv. 10."
            },
            "upgrade4Name": "Zephyrean Echoes",
            "upgrade4Desc": {
                "formatted": "When \"Roaring Bowstrings\" is active, Yukong deals 30% more DMG to enemies."
            },
            "upgrade5Name": "August Deadshot",
            "upgrade5Desc": {
                "formatted": "Ultimate Lv. +2, up to a maximum of Lv. 15. Talent Lv. +2, up to a maximum of Lv. 15.\n\n"
            },
            "upgrade6Name": "Bowstring Thunderclap",
            "upgrade6Desc": {
                "formatted": "When Yukong uses her Ultimate, she immediately gains 1 stack(s) of \"Roaring Bowstrings.\""
            }
        }
    ],
    "synergy": null,
    "traces": [
        {
            "req": "A2",
            "desc": "Yukong can resist 1 debuff application for 1 time. This effect can be triggered again in 2 turn(s).",
            "name": "Archerion"
        },
        {
            "req": "A4",
            "desc": "When Yukong is on the field, Imaginary DMG dealt by all allies increases by 12%.",
            "name": "Bowmaster"
        },
        {
            "req": "A6",
            "desc": "When Roaring Bowstrings is active, Yukong regenerates 2 additional Energy every time an ally takes action.",
            "name": "Majestas"
        }
    ],
    "review": {
        "formatted": "Yukong is a support with extraordinarily powerful buffs and breaking utility, but is definitely one of the most challenging units to use thus far. She requires more effort to use than the other Harmony characters, substantially so in fact, but she can assuredly be worth the effort—if you’re willing to work for it.I’ll start with Yukong’s Talent, because it’s something of an outlier as far as expected support Talents. Every other turn, Yukong’s Basic attack gets Enhanced, dealing up to an additional 80% of her ATK at max Trace level, as well as increasing the Toughness damage by 100%! A Basic attack dealing damage potentially equal to 180% of a character’s ATK while still restoring a Skill Point is already exceptional, but the fact it deals twice as much Toughness damage as well is just insane. Yukong can end up contributing a huge amount of Toughness damage thanks to this one Talent, and because it actually has a decent multiplier, she can contribute pretty decent team damage as well.Her primary method of buffing is through her Skill. Using it gives Yukong 2 stacks of Roaring Bowstrings, increasing the ATK of all allies by up to 80% at max Trace level, while stacks persist. She loses 1 stack on every ally turn after hers. This buff can be compounded further thanks to her Ultimate.Yukong’s Ultimate targets a single enemy, and deals a very respectable amount of damage, up to 380% of her ATK at max Trace level. At the same time, if Roaring Bowstrings is still active, it will add up to 28% Crit Rate and 65% Crit DMG to the effects of Roaring Bowstrings at max Trace level. Both of these effects combined means Yukong can provide 80% ATK, 28% Crit Rate and 65% Crit DMG all by herself. This also has a remarkably high damage multiplier for a support, and since these buffs are all active before the Ultimate’s damage comes out, said Ultimate benefits fully from all of these fantastic effects.However, you may have already noticed a glaring issue in that the very powerful Roaring Bowstrings effects will dissipate before your third ally turn, meaning one of your characters will never be affected by it. Ever. But it’s okay, you can do some pre-planning to make sure that Yukong is always acting immediately before your main damage dealer, and that way they’ll always be able to make use of her buffs, right? Ah but what if there are fluctuating SPD values due to various buffs and debuffs that many units and enemies have?Well, this is where problems arise. You can definitely plan a team in advance and expect that Yukong’s buffs will always affect the correct allies, but realistically there are inevitably going to be extenuating circumstances that interfere with that plan. Allies may fall in and out of ideal turn order due to many different things, and it falls to the player to make the most out of whatever hand you’re dealt.If you’re using characters that naturally alter their SPD or have mechanics like turn advance, such as Sushang or a Wind damage dealer using the Eagle of Twilight Line relic set, this is not that big of a concern actually, because even if a desync occurs, they will naturally realign themselves over time anyway. It’s a little more problematic if a desync occurs with characters that have set SPD values, but again, it’s not insurmountable. The way you can work around this is by paying attention to the specific wording of Yukong’s Skill; every ally turn will consume a stack, meaning any and all Extra Actions can be freely used as long as 1 stack of Roaring Bowstrings persists. This includes ally Ultimates, so especially if the majority of a character’s power is concentrated into their Ultimate, they can still benefit fully from Yukong’s buffs even if a turn desync occurs.Keeping track of all of these aspects of Yukong’s kit is incredibly demanding, what with managing her powerful buffs efficiently and actually having meaningful uses of her Ultimate, while still trying to find good uses of her equally powerful Talent. It is not an understatement to call her the most difficult-to-play unit to date. Even Qingque is simple by comparison, but as with our favorite mahjong gremlin, the effort is well worth the output.Yukong’s Bonus Traces are very impactful and have a big effect on her performance. Her A2 allows her to resist 1 debuff once every 2 turns. This means any debuff at all, be it a DoT or a crowd-controlling debuff like Imprisonment, so this can potentially prevent the aforementioned turn desync from occurring from Yukong’s side at least.Her A4 increases all Imaginary DMG dealt by all allies by 12% as long as she’s alive, meaning she’s going to be a good pairing with Imaginary damage dealers like Welt, and this even goes a long way to improving her own personal damage contribution. The most impactful Bonus Trace is her A6. When Roaring Bowstrings is active, Yukong regenerates 2 additional Energy every time an ally takes action. Note it says action and not turn, meaning Extra Actions and Ultimates will also contribute to this Energy regeneration, even Yukong’s own Ultimate usage, and this is actually a very significant amount of Energy coming back to Yukong over the course of a fight.Yukong’s Eidolons are not necessary for her to perform exceptionally at E0, but they are welcome all the same. E2, E4, and especially E6 provide notable quality-of-life improvements, but Yukong’s skill floor unfortunately remains quite high regardless.If you’re willing to put in the effort for this silver fox, she’ll perform amazingly both now and well into the future too. She has everything you may want from a support and then some, but it’s locked behind layers of nuance and understanding. Can she be a formidable buffer akin to Tingyun and Bronya? Absolutely, but whether or not she’ll reach those heights… That depends on the skill of the runner."
    },
    "pros": {
        "formatted": "Top tier damage buffs, Absurdly high skill ceiling, Significant Toughness damage, Notable personal damage, Scales extremely well into the end game.\n\n"
    },
    "cons": {
        "formatted": "Regrettably high skill floor, Extremely hard to play to her fullest, Very weak early game, High reliance on A6 for Energy needs.\n\n"
    },
    "endgameStats": {
        "formatted": "HP: 3700 - 4500+DEF: 700 - 1300+SPD: 1-2 Speed slower than sustainENERGY REGEN: 19.44%+ "
    },
    "voiceActors": {
        "en": "Dawn M. Bennett",
        "kr": "전숙경 (Jeon Sook-kyung)",
        "jpn": "冬馬由美 (Yumi Tōma)",
        "cn": "钟可 (Zhong Ke)"
    },
    "ratings": {
        "moc": "5",
        "moc_special": "4",
        "pure": "4",
        "pure_special": "4",
        "apo": "5",
        "apo_special": "4"
    },
    "energyUltimate": "130",
    "conesNew": [
        {
            "cone": "planetary-rendezvous",
            "super": "5",
            "percent": "-",
            "notes": "Increases the damage of all units of the same elemental type as the wearer. A good generic damage increase for damage dealers that matches the element of the support but should not be used outside of this scenario. One of the top options for a more damage-focused Yukong."
        },
        {
            "cone": "memories-of-the-past",
            "super": "5",
            "percent": "-",
            "notes": "Offers 8 energy per attacking action at S5 making it equivalent to Meshing Cogs but with better base stats and a large amount of Break Effect. Does not have the 8 energy when taking damage compared to its alternative though which makes it less effective at achieving the shortest rotations possible. Allows much faster access to Yukong's Ultimate and is also a top option for damage-focused Yukong."
        },
        {
            "cone": "but-the-battle-isnt-over",
            "super": "1",
            "percent": "-",
            "notes": "Provides Energy Regeneration and a massive damage increase to the character who moves after the wearer uses their skill. In addition to this, every other Ultimate cast will grant the team 1 skill point. An extremely situational Cone on Yukong - if you are Speed tuning Yukong 1 Speed slower than your main DPS and using her skill frequently this Cone can be effective but you won't get the Skill Point on ultimate use as her ultimate is not a buff."
        },
        {
            "cone": "meshing-cogs",
            "super": "5",
            "percent": "-",
            "notes": "A F2P Accessible Cone with poor base stats but which grants the wearer an additional 8 energy per attacking action they perform. Also grants another 8 energy whenever they receive damage from an enemy action. The combination of both energy effects can drastically reduce the required actions per Ultimate for most supports. Allows much faster access to Yukong's Ultimate but lowers her potential damage output substantially due to low base stats."
        },
        {
            "cone": "carve-the-moon-weave-the-clouds",
            "super": "5",
            "percent": "-",
            "notes": "Offers one of three random buffs that rotates throughout combat. A fine option when no other alternatives are available but often overshadowed by other more consistent or powerful harmony Cone options."
        }
    ],
    "buildData": [
        {
            "relics": [
                {
                    "relic": "Messenger Traversing Hackerspace",
                    "relic_2": "Longevous Disciple",
                    "value": null,
                    "comment": null,
                    "notes": null
                },
                {
                    "relic": "Messenger Traversing Hackerspace",
                    "relic_2": "Guard of Wuthering Snow",
                    "value": null,
                    "comment": null,
                    "notes": null
                },
                {
                    "relic": "Musketeer of Wild Wheat",
                    "relic_2": "",
                    "value": null,
                    "comment": null,
                    "notes": null
                }
            ],
            "planars": [
                {
                    "planar": "Broken Keel",
                    "value": null,
                    "comment": null,
                    "notes": null
                },
                {
                    "planar": "Fleet of the Ageless",
                    "value": null,
                    "comment": null,
                    "notes": null
                }
            ],
            "cones": [
                {
                    "cone": "memories-of-the-past",
                    "super": "1"
                },
                {
                    "cone": "meshing-cogs",
                    "super": "5"
                }
            ],
            "body": [
                {
                    "stat": "HP%"
                }
            ],
            "feet": [
                {
                    "stat": "Speed"
                }
            ],
            "rope": [
                {
                    "stat": "Energy Regen Rate"
                }
            ],
            "sphere": [
                {
                    "stat": "HP%"
                },
                {
                    "stat": "DEF%"
                }
            ],
            "comments": "Make sure her SPD is tuned between the team so she acts before the DPS. Yukong prefers tank stats in order to survive, so focus on them once you reach the needed SPD breakpoint.",
            "substats": "SPD > HP = DEF > EFF RES% (30% if using Broken Keel)",
            "skill_priority": "Skill > Ultimate > Talent = Basic",
            "traces_priority": "Archerion (A2) > Majestas (A6) > Bowmaster (A4)",
            "name": "Support"
        }
    ],
    "videos": [
        {
            "video": "4lTea-AUxYU"
        },
        {
            "video": "jehwqk371MY"
        }
    ],
    "teams": [
        {
            "name": "Hypercarry duo-element",
            "member_1": "yukong",
            "member_2": "luocha",
            "member_3": "seele",
            "member_4": "silver-wolf"
        }
    ],
    "characterBuilderInfo": {
        "traceStat1": {
            "stat": "atk",
            "value": 10
        },
        "traceStat2": {
            "stat": "dmg_imaginary",
            "value": 22.4
        },
        "traceStat3": {
            "stat": "hp",
            "value": 18
        },
        "traceStatMajor1": {
            "stat": "",
            "value": 0
        },
        "traceStatMajor2": {
            "stat": "",
            "value": 0
        },
        "traceStatMajor3": {
            "stat": "",
            "value": 0
        }
    },
    "tierCategory": "Amplifier",
    "releaseDate": "June 28th, 2023",
    "isReleased": true,
    "isNew": false,
    "hideSkills": false,
    "isReviewPending": false,
    "availableInCbt3": false,
    "showBuild": true,
    "tierListNew": false,
    "tierListTags": [
        "Buff"
    ]
}